function [U, S, V] = PCA(data)
% U 每一列是一个特征向量，已排好序
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%   PCA：主成分分析基本步骤
%   1、求协方差矩阵（散度矩阵）
%   2、求解特征值与特征向量（eig或svd方法）
%   3、投影
%   4、重构图片
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% mean_face     平均脸
% center_data   中心化后的样本矩阵
[~, center_data] = center(data);    % 中心化

% 1、协方差矩阵
% cov_mat = center_data * center_data';   % 由于已中心化，故原矩阵协方差矩阵就这么求解
% 因为我构建的矩阵是每一列为一个样本，故计算协方差矩阵 X*X'，而不是 X'*X

% 2、求解特征值与特征向量
% 使用奇异值分解svd解特征值和特征向量，就不需要计算协方差矩阵了
[U, S, V] = svd(center_data);               % 奇异值分解
% U的列向量是协方差矩阵的特征向量
% 也即是按特征值降序排列的特征脸
end

